"""
Відповідь на перше запитання:
import asyncio

async def fetch_data():
await asyncio.sleep(1)
return {"data": 123}

def sync_main():
result = asyncio.run(fetch_data())
print(f"Received: {result}")
"""


"""
Відповідь на друге запитання:
Заміна sqlite3 на aiosqlite
кожне завдання намагається відкрити своє поєднання з БД
Якщо ви відкрили транзакцію і всередині неї зробили await 
важкого запиту до іншого API, транзакція в БД залишатиметься 
відкритою («висіти»), блокуючи таблиці для інших користувачів.
Спроба обернути синхронну ORM в run_in_executor працює,
але це «милиця», яка з'їдає багато пам'яті на потоки.
через те, що запити виконуються паралельно, два асинхронні
воркери можуть одночасно спробувати оновити один і той же рядок у базі.
"""
